{
  "auto_mapping": null,
  "base_model_name_or_path": "facebook/bart-base",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 12,
  "num_layers": 6,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 30,
  "peft_type": "PROMPT_TUNING",
  "peft_version": "0.18.0",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify the statement as True or False.",
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 768,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "facebook/bart-base"
}